<h1 style="display:none;">Test</h1>
<h1 style="display:none;">Test</h1>
<h1 style="display:none;">Test</h1>
<h1 style="display:none;">Test</h1>
<h1 style="display:none;">Test</h1>
<h1 style="display:none;">Test</h1>
<h1 style="display:none;">Test</h1>
<h1 style="line-height: 1.3;">W4111 $-$ Introduction to Databases: <br>Modeling Patterns, DBMS Implementation, Disks, Indexes</h1>

## Helper Code

In [2]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuser@localhost/lahman2017
%sql select * from people where playerid='willite01'

import pymysql.cursors
import pandas as pd
import json

# The database server is running somewhere in the network.
# I must specify the IP address (HW server) and port number
# (connection that SW server is listening on)
# Also, I do not want to allow anyone to access the database
# and different people have different permissions. So, the
# client must log on.


# Connect to the database over the network. Use the connection
# to send commands to the DB.
cnx = pymysql.connect(host='localhost',
                             user='dbuser',
                             password='dbuser',
                             db='lahman2017',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)

1 rows affected.

In [3]:
import json
%sql select * from people where playerid='willite01'

1 rows affected.

[('willite01', 1918, 8, 30, 'USA', 'CA', 'San Diego', '2002', '7', '5', 'USA', 'FL', 'Inverness', 'Ted', 'Williams', 'Theodore Samuel', '205', '75', 'L', 'R', '1939-04-20', '1960-09-28', 'willt103', 'willite01', datetime.date(1918, 8, 30))]

In [4]:
def run_q(q, args, fetch=False):
    """
    # Helper method to centralize database queries and returning responses.
    :param q: SQL query string that MAY contain %s entries to be filled with args.
    :param args: Optional args to include with query submission to insert into %s
    :param fetch: If true, call and return fetchall(). Not all SQL statements return a value.
    :return: Query result or None
    """
    print("run_q: q= " + q, args)

    result  =   None
    cursor = cnx.cursor()
    cursor.execute(q, args)

    # Obtain query results if requested.
    if fetch:
        result = cursor.fetchall()

    cnx.commit()    # Commit operation, release active session and release locks.
    return result

__NOTE: Show the class the new connection code or they will be miserable, i.e. closing connections!!!__

## Lecture Overview

- Overview: Entity $-$ Relationship Modeling, Object$-$Oriented Modeling, Object Relational Mapping (ORM)
<br><br>
- Modeling patterns and realizations:
    - Many-to-Many relationships.
    - Inheritance.
    - Functional dependency.
<br><br>
- Module II Topics: Reminder
<br><br>
- Disks, storage and input/output.

## Modeling and Notation

### Data Modeling

| <img src="../images/datamodel1.jpeg"> |
| :---: |
| [Data Model](https://en.wikipedia.org/wiki/Data_model) |

- “Data modeling (data modelling) is the analysis of data objects and their relationships to other data objects. Data modeling is often the first step in database design and object-oriented programming as the designers first create a conceptual model of how data items relate to each other. Data modeling involves a progression from conceptual model to logical model to physical schema.” (http://www.webopedia.com/TERM/D/data_modeling.html)


- “What is a datamodel?
A data model is a __notation__ for describing data or information. The description generally consists of three parts:
    - Structure of data.
    - Operations on the data.
    - Constraints on the data.”<br>
(Database Systems: The Complete Book (2nd Edition)
by Hector Garcia-Molina (Author), Jeffrey D. Ullman (Author), Jennifer Widom (Author))


- Some teams and projects do systematic data modeling as part of solution planning, design and development. All projects do some form of informal, opportunistic data modeling.


- We will go over some concepts quickly, and more importantly some examples. This will provide a foundation for what you decide to do in the future.


- Conceptual-Logical-Physical

| <img src="../images/conceptuallogicalphysical.jpeg"> |
| :---: |
| [Data Model](https://en.wikipedia.org/wiki/Data_model) |


- __Notation:__ 
    - "A visual notation is a graphical representation. It consists of graphical symbols, their definitions, and a visual grammar. Some examples of graphical symbols are: lines, surfaces, volumes, textual labels and spatial relationships. These elements are used to build the visual vocabulary of a notation; Mind Maps for example, consist of lines and labels. Visual representations are effective because they convey information more concisely and precisely than language. They are also better remembered." (https://www.sciencedaily.com/releases/2013/07/130718161429.htm)
    - Think "well-defined clipart" with grammar (rules, meaning)

### Crow's Foot Notation

- I normally use this notation in class.


- MySQL Workbench Designer also uses an extended version of this notation.

| <img src="../images/crows_foot_notation.jpeg" width="75%"> |
| --- |
| [Crow's Foot Notation](http://www.vivekmchawla.com/erd-crows-foot-relationship-symbols-cheat-sheet/) |

### Chen Notation
- I tend to use simple entity-relationationship notation in class. This is not a data modeling course.


- Crow's Foot is simple and precise, and good enough for our purposes.


- The textbook uses Chen Notation, which is more complete and complex.


- [Lucidchart](https://www.lucidchart.com/pages/ER-diagram-symbols-and-meaning) has a good summary of symbols, but we will not use the notation in course. We may use some of the terms.


| <img src="../images/chen_notation.jpeg">
| --- |
| __Chen Notation__ |

- __Weak Entity:__ (Ramakrishnan and Gherke, p35)<br><br>
    - "In a relational database, a weak entity is an entity that cannot be uniquely identified by its attributes alone; therefore, it must use a foreign key in conjunction with its attributes to create a primary key. The foreign key is typically a primary key of an entity it is related to." (https://en.wikipedia.org/wiki/Weak_entity)
    <br><br>
    - ```Course_Section``` is a simple example. The Vergil URL for this course's section is https://vergil.registrar.columbia.edu/#/courses/20183COMS4111W001
    <br><br>
    - The sections's "key" cannot exist with an existing instance of some other entity's key, e.g. ```COMS4111.```
    <br><br>
    - MySQL and other systems use the term [Identifying Relationship](http://www.vertabelo.com/blog/documentation/defining-identifying-and-non-identifying-relationships-in-vertabelo), which is a very similar concept.
    
| <img src="../images/courses_sections.jpeg"> |
| :---: |
| __Courses and Sections: Weak Entity/Identifying Relationship__ |


- __Associative Entity:__ "An associative entity is a term used in relational and entity–relationship theory. A relational database requires the implementation of a base relation (or base table) to resolve many-to-many relationships. A base relation representing this kind of entity is called, informally, an associative table." (https://en.wikipedia.org/wiki/Associative_entity)
    <br><br>
    - Relational DB approach to implementing a many-to-many association.
    <br><br>
    - Allows the relationship to have attributes/properties.
    <br><br>
    - ```Person-Course_Section``` is a familiar example.
    
| <img src="../images/associative_entity.jpeg"> |
| :---: |
| __Person_Courses: Associative Entity__ |

__Weak Association:__ The relationship between a weak entity and the "owner."


__Derived Attribute:__ Derived attributes are attributes whose value can be calculated from related attribute values.

## Lahman 2017 Data Model

### Some Cleanup Examples

#### Overview

- I will periodically go through some examples of "cleaning up the data."


- Mostly to give you a feel of the kind of things that happen during data cleanup.

#### Date of Birth

- This one was unpleasant.


- There are three text columns ```birthYear, birthMonth, birthDay.```
    - The raw data uses "" for NULL.
    - Some entries have "" for all or some of the columns.
    
    
- I could have written a Python (or other function) to do the conversion, but wanted to show how to use database tools.


- I wrote a function to "safely" convert three date columns to a MySQL ```DATE``` type.

```
CREATE DEFINER=`root`@`localhost` FUNCTION `people_date_to_date`(year int, month int, day int) RETURNS date
BEGIN

	DECLARE s VARCHAR(12);
    DECLARE d DATE;
    
	IF (year is NULL) OR (month is NULL) OR (day is NULL) THEN
		SET d = NULL;
	ELSE
		SET s = concat(cast(day as char),',',cast(month as char),',',cast(year as char));
		SET d = str_to_date(s, '%d,%m,%Y');
	END IF;
    
RETURN d;
END
```

- I subsequently ran the following script.

```
# Get rid of "" and replace with NULL
update  lahman2017.People set birthyear = NULL where birthYear="";
update  lahman2017.People set birthDay = NULL where birthDay="";
update  lahman2017.People set birthMonth = NULL where birthMonth="";

ALTER TABLE `lahman2017`.`People` 
CHANGE COLUMN `birthYear` `birthYear` INT NULL DEFAULT NULL ,
CHANGE COLUMN `birthMonth` `birthMonth` INT NULL DEFAULT NULL ,
CHANGE COLUMN `birthDay` `birthDay` INT NULL DEFAULT NULL ;

# Could not alter the original column. Will use a temporary column to clean up
# dates, etc.
ALTER TABLE `lahman2017`.`People` 
ADD COLUMN `DOB` DATE NULL AFTER `bbrefID`;

update people set dob=people_date_to_date(birthYear,birthMonth,birthDay);
```

- The result has the following format:

In [5]:
%sql select nameLast, nameFirst, playerid, dob from people limit 10;

10 rows affected.

[('Aardsma', 'David', 'aardsda01', datetime.date(1981, 12, 27)),
 ('Aaron', 'Hank', 'aaronha01', datetime.date(1934, 2, 5)),
 ('Aaron', 'Tommie', 'aaronto01', datetime.date(1939, 8, 5)),
 ('Aase', 'Don', 'aasedo01', datetime.date(1954, 9, 8)),
 ('Abad', 'Andy', 'abadan01', datetime.date(1972, 8, 25)),
 ('Abad', 'Fernando', 'abadfe01', datetime.date(1985, 12, 17)),
 ('Abadie', 'John', 'abadijo01', datetime.date(1850, 11, 4)),
 ('Abbaticchio', 'Ed', 'abbated01', datetime.date(1877, 4, 15)),
 ('Abbey', 'Bert', 'abbeybe01', datetime.date(1869, 11, 11)),
 ('Abbey', 'Charlie', 'abbeych01', datetime.date(1866, 10, 14))]

- I can do the same thing for 'date of death.'

```
update  lahman2017.People set deathyear = NULL where deathYear="";
update  lahman2017.People set deathDay = NULL where deathDay="";
update  lahman2017.People set deathMonth = NULL where deathMonth="";

ALTER TABLE `lahman2017`.`People` 
CHANGE COLUMN `deathYear` `deathYear` INT NULL DEFAULT NULL ,
CHANGE COLUMN `deathMonth` `deathMonth` INT NULL DEFAULT NULL ,
CHANGE COLUMN `deathDay` `deathDay` INT NULL DEFAULT NULL ;

# Could not alter the original column. Will use a temporary column to clean up
# dates, etc.
ALTER TABLE `lahman2017`.`People` 
ADD COLUMN `DOD` DATE NULL AFTER `bbrefID`;

update people set dod=people_date_to_date(deathYear,deathMonth,deathDay);
```

In [6]:
%sql select nameLast, nameFirst, playerid, dob, dod from people limit 10;

10 rows affected.

[('Aardsma', 'David', 'aardsda01', datetime.date(1981, 12, 27), None),
 ('Aaron', 'Hank', 'aaronha01', datetime.date(1934, 2, 5), None),
 ('Aaron', 'Tommie', 'aaronto01', datetime.date(1939, 8, 5), datetime.date(1984, 8, 16)),
 ('Aase', 'Don', 'aasedo01', datetime.date(1954, 9, 8), None),
 ('Abad', 'Andy', 'abadan01', datetime.date(1972, 8, 25), None),
 ('Abad', 'Fernando', 'abadfe01', datetime.date(1985, 12, 17), None),
 ('Abadie', 'John', 'abadijo01', datetime.date(1850, 11, 4), datetime.date(1905, 5, 17)),
 ('Abbaticchio', 'Ed', 'abbated01', datetime.date(1877, 4, 15), datetime.date(1957, 1, 6)),
 ('Abbey', 'Bert', 'abbeybe01', datetime.date(1869, 11, 11), datetime.date(1962, 6, 11)),
 ('Abbey', 'Charlie', 'abbeych01', datetime.date(1866, 10, 14), datetime.date(1926, 4, 27))]

- I can now start asking questions about time, time spans, etc.


- Who had the longest lifespan so far?

In [14]:
%sql select nameLast, nameFirst, playerid, dob, dod, datediff(dod,dob) as lifespan_in_days \
        from people where (dob is not null) and (dod is not null) \
        order by lifespan_in_days desc limit 10;

10 rows affected.

[('Hoff', 'Red', 'hoffch01', datetime.date(1891, 5, 8), datetime.date(1998, 9, 17), 39213),
 ('Marrero', 'Connie', 'marreco01', datetime.date(1911, 4, 25), datetime.date(2014, 4, 23), 37619),
 ('Wright', 'Bob', 'wrighbo01', datetime.date(1891, 12, 13), datetime.date(1993, 7, 30), 37119),
 ('Parker', 'Ace', 'parkeac01', datetime.date(1912, 5, 17), datetime.date(2013, 11, 6), 37063),
 ('Malinosky', 'Tony', 'malinto01', datetime.date(1909, 10, 7), datetime.date(2011, 2, 8), 37014),
 ('Swanson', 'Karl', 'swanska01', datetime.date(1900, 12, 17), datetime.date(2002, 4, 3), 36997),
 ('Daley', 'John', 'daleyjo01', datetime.date(1887, 5, 25), datetime.date(1988, 8, 31), 36988),
 ('Otis', 'Bill', 'otisbi01', datetime.date(1889, 12, 24), datetime.date(1990, 12, 15), 36880),
 ('Stiles', 'Rollie', 'stilero01', datetime.date(1906, 11, 17), datetime.date(2007, 7, 22), 36772),
 ('Werber', 'Billy', 'werbebi01', datetime.date(1908, 6, 20), datetime.date(2009, 1, 22), 36741)]

- Who are the oldest people for whom we do not have a date of death?

In [16]:
%sql select nameLast, nameFirst, playerid, dob, dod, datediff(now(),dob) as lifespan_in_days \
        from people where (dob is not null) and (dod is null) \
        order by lifespan_in_days desc limit 10;

10 rows affected.

[('Daily', 'Hugh', 'dailyhu01', datetime.date(1847, 7, 17), None, 62548),
 ('Dailey', 'John', 'dailejo01', datetime.date(1853, 10, 26), None, 60255),
 ('Purcell', 'Blondie', 'purcebl01', datetime.date(1854, 3, 16), None, 60114),
 ('Landis', 'Doc', 'landido01', datetime.date(1854, 8, 16), None, 59961),
 ("O'Neil", 'Hugh', 'oneilj01', datetime.date(1856, 4, 12), None, 59356),
 ('Foley', 'John', 'foleyjo01', datetime.date(1857, 10, 25), None, 58795),
 ('Muldoon', 'Mike', 'muldomi01', datetime.date(1858, 4, 9), None, 58629),
 ('Sweeney', 'Rooney', 'sweenro01', datetime.date(1858, 11, 1), None, 58423),
 ('Vadeboncoeur', 'Gene', 'vadebge01', datetime.date(1859, 9, 5), None, 58115),
 ('Kent', 'Ed', 'kented01', datetime.date(1859, 9, 17), None, 58103)]

- Wow. Hugh Daily is 171 years old!


- The longest known human lifespan is 122 years (https://en.wikipedia.org/wiki/Oldest_people).


- Let's use this heuristic.

In [18]:
%sql select nameLast, nameFirst, playerid, dob, dod, datediff(now(),dob) as lifespan_in_days \
        from people where (dob is not null) and (dod is null) and (year(now())-year(dob)) < 122 \
        order by lifespan_in_days desc limit 10;

10 rows affected.

[('Stevens', 'Chuck', 'stevech01', datetime.date(1918, 7, 10), None, 36623),
 ('Caligiuri', 'Fred', 'caligfr01', datetime.date(1918, 10, 22), None, 36519),
 ('Jordan', 'Tom', 'jordato01', datetime.date(1919, 9, 5), None, 36201),
 ('Mills', 'Bill', 'millsbi01', datetime.date(1919, 11, 2), None, 36143),
 ('Garcia', 'Dave', 'garcida99', datetime.date(1920, 9, 15), None, 35825),
 ('Heim', 'Val', 'heimva01', datetime.date(1920, 11, 4), None, 35775),
 ('Westlake', 'Wally', 'westlwa01', datetime.date(1920, 11, 8), None, 35771),
 ('Robinson', 'Eddie', 'robined01', datetime.date(1920, 12, 15), None, 35734),
 ('Elder', 'George', 'elderge01', datetime.date(1921, 3, 10), None, 35649),
 ('Conatser', 'Clint', 'conatcl01', datetime.date(1921, 7, 24), None, 35513)]

- "Charles Augustus Stevens, Jr. (July 10, 1918 – May 28, 2018) was a first baseman in Major League Baseball who played for the St. Louis Browns in parts of three seasons (1941, 1946, 1948). Listed at 6' 1", 180 lb., Stevens was a switch-hitter and threw left-handed. He was born in Van Houten, New Mexico." (https://en.wikipedia.org/wiki/Chuck_Stevens)


- What about Clint Conatser?

| <img src="../images/clint_conatser.jpeg"> |
| :---: |
| [Clint Conatser](https://en.wikipedia.org/wiki/Clint_Conatser) |

- __Summary:__
    - Database engines have sophisticated, built in types and operations for date, time, etc.
    - Cleaning up dates can be tricky when importing raw data.

## Object Relational Mapping (ORM)

### Overview

- Object oriented systems/programming have four characteristics
    - Abstraction
    - Encapsulation
    - Inheritance
    - Polymorphism
    
    
- Abstraction, encapsulation and polymorphism are principles that apply to the application.


- _Inheritance_ applies to data and is a type of _relationship_ between data types. $\rightarrow$ Must be able to model/represent in a database because "relational data" is about "relations" between entity properties and entity types.

#### Unified Modeling Language

Ramakrishnan and Gehrke, section 2.7

- There are many ways to classify ER relationships
    - Optional versus Mandatory.
    - Endpoint cardinality.
    - Logical containment (Weak Entity) versus references.
    
    
- Objected oriented adds an additional type of relationship, _Is A._
    - A student _Enrolls In_ classes. Students and classes have different schema and data elements.
    - A student _Is A_ person. A student's schema and properties is somehow linked to person.

- The [Unified Modeling Language (UML)](https://en.wikipedia.org/wiki/Unified_Modeling_Language) is the most common notation for object-oriented modeling.


- UML relationships

| <img src="../images/UML_relationships.jpeg"> |
| --- |
| __UML Relationships__ |

### Object Oriented and Inheritance Modeling Patterns

#### Overview

- This is an incredibly complex problem in general.


- There is an industry of products and tools for [object relational mapping (ORM).](https://en.wikipedia.org/wiki/Object-relational_mapping) 


- We are going to focus on core, simple cases because
    - The pattern is common in database design and implementation scenarios.
    - A use case that shows roles of views, constraints, triggers, functions and procedures.
    
    
- There are [three basic patterns:](http://www.vertabelo.com/blog/technical-articles/inheritance-in-a-relational-database) 1 table, 2 table and 3 table.


- The technical term for _inheritance_ and _realization_ is _specialization._


- There are two core _constraints_ or _facets_ of specialization
    - _Incomplete/complete_
        - In an incomplete specialization only some instances of the parent class are specialized (have unique attributes). Other instances of the parent class have only the common attributes.
        - In a complete specialization, every instance of the parent class has one or more unique attributes that are not common to the parent class.
    - _Disjoint/overlapping_
        - In a disjoint specialization, an object could be a member of only one specialized subclass.
        - In an overlapping specialization, an object could be a member of more than one specialized subclass.

#### One Table Solution

##### Overview and Views

| <img src="../images/inheritance_one.jpeg"> |
| --- |
| __One Table Solution__ |

- There is a single table containing all data for all instances of all types.


- Database views implement _projection_ to create the entity types _student_ and _faculty._

```
CREATE TABLE `person_one` (
  `uni` varchar(32) NOT NULL,
  `last_name` varchar(45) NOT NULL,
  `first_name` varchar(45) NOT NULL,
  `email` varchar(45) GENERATED ALWAYS AS (concat(`uni`,'@columbia.edu')) STORED,
  `type` enum('S','F') NOT NULL,
  `title` varchar(45) DEFAULT NULL,
  `year` varchar(45) DEFAULT NULL,
  `school` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`uni`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE VIEW
	faculty_one
AS SELECT
	uni, last_name, first_name, email, title
FROM
	University.person_one
WHERE
	University.person_one.type = 'F';
    
CREATE VIEW
	student_one
AS SELECT
	uni, last_name, first_name, school, year
FROM
	University.person_one
WHERE
	University.person_one.type = 'S';

```

- This approach is fine for _retrieve,_ but what about _create, update_ and _delete._
    - Programmers think in terms of create, update and delete student/faculty but need to know implementation details that may change. What if I add a new type _staff?_ This could force changing client programs.
    - There are some odd constraints. _year_ must be NULL if _type_ is _F_ but NOT NULL if type is _S._
    
    
- Our solution will be
    - Implement CREATE, UPDATE and DELETE triggers on _Person._
    - Restrict access to INSERT, UPDATE and DELETE on _Person_ to specific security roles.
    - Provide procedures _create_student, delete_student, update_student, create_faculty, delete_faculy_ and _update_faculty._
    
    
- This approach improves data integrity, simplifies client application development and isolates applications from schema and design changes.

##### Person One

- Identify the more complex integrity rules. We will "protect" the person table behind procedures but still need to protect the table's integrity.

```
CREATE DEFINER=`root`@`localhost` TRIGGER `University`.`person_one_BEFORE_INSERT`
	BEFORE INSERT ON `person_one` FOR EACH ROW
BEGIN

	SET New.uni = LOWER(generate_uni(New.last_name, New.first_name));
    
    IF New.type = 'S' THEN
    
		IF (New.year IS NULL) OR (New.school is NULL) OR (New.title IS NOT NULL) THEN
			SIGNAL SQLSTATE '45001'
				SET MESSAGE_TEXT = 'Invalid properties for student', MYSQL_ERRNO=9001;
		END IF;
        
	ELSE
    
		IF (New.year IS NOT NULL) OR (New.school is NOT NULL) OR (New.title IS NULL) THEN
			SIGNAL SQLSTATE '45001'
				SET MESSAGE_TEXT = 'Invalid properties for faculty', MYSQL_ERRNO=9001;
		END IF;
		
	END IF;

END
```

- We would do a similar procedure for UPDATE.


- Now, we need to stop client applications from directly messing things up. So, we will limit the privileges for the applications.

```
REVOKE ALL ON * FROM university_client;
GRANT SELECT ON University.student_one TO university_client;
GRANT SELECT ON University.faculty_one TO university_client;
```

- The REVOKE and GRANT syntaxes are complicated, and the exact model and syntax vary between database management systems.


- The common core elements of any _role based access control rule_(https://en.wikipedia.org/wiki/Role-based_access_control) are
    - [Least privilege principle](https://en.wikipedia.org/wiki/Principle_of_least_privilege): Give a user/role ONLY the permissions necessary to implement functions. 
    - The user (role, group), e.g. citizenship, clearance, etc.
    - The resource e.g. schema/database, table, view, etc.
    - The action, e.g. INSERT, DROP TABLE, ...
    - The context e.g. time, location, source IP, ...
    

- Applied to relational (MySQL) this means

```
GRANT sql_verb(s) ON sql_resource(s) TO user_id(s)
```

##### Procedures

- There will be a set of procedures encapsulating the underlying table.


- The client applications
    - Cannot INSERT, UPDATE, DELETE tables.
    - Can CALL procedures.
    - The databasea analyst carefully develops procedures to ensure integrity. The procedures can INSERT, UPDATE and DELETE the base tables because they run with the permissions of the procedure writer.

```
CREATE DEFINER=`root`@`localhost` PROCEDURE
	`create_student_one`(IN last_name VARCHAR(64), IN first_name VARCHAR(64),
		IN year CHAR(4), IN school CHAR(6))
BEGIN

	DECLARE msg VARCHAR(32);
    
	IF NOT EXISTS (SELECT * FROM schools WHERE code = school) THEN
		SET msg = concat("Invalid school code=",school);
		SIGNAL sqlstate '50001'
			set message_text=msg;
	END IF;
    
    IF year <= year(now()) OR year >= (year(now())+8) THEN
		SET msg = concat("Year ust be between ",year(now())," - ", (year(now())+8));
		SIGNAL sqlstate '50002'
			set message_text=msg;
    END IF;
    
    INSERT INTO person_one(last_name,first_name,type,year,school)
		VALUES(last_name,first_name,"S",year,school);
    
END
```

- We would do similar functions
    - delete_person_one, update_person_one
    - create_faculty_one, update_faculty_one, delete_faculty_one
    - And update, delete, etc. triggers for person_one
    
    
__Note: the _one on the end is just because there are also two and three table solutions.__

- The GRANT statement

```
GRANT  SELECT  ON University.* TO university_client;
GRANT  EXECUTE  ON PROCEDURE University.create_student_one TO university_client;
```

##### Two Table Solution

| <img src="../images/two_table.jpeg">
| :---: |
| __Two Table Solution__ |

- Some (incomplete schema)

```
CREATE TABLE `faculty_two` (
  `uni` varchar(32) NOT NULL,
  `last_name` varchar(45) NOT NULL,
  `first_name` varchar(45) NOT NULL,
  `email` varchar(45) DEFAULT NULL,
  `title` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `student_two` (
  `uni` varchar(32) NOT NULL,
  `last_name` varchar(45) NOT NULL,
  `first_name` varchar(45) NOT NULL,
  `school` varchar(45) DEFAULT NULL,
  `year` varchar(45) DEFAULT NULL,
  `email` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE 
    ALGORITHM = UNDEFINED 
    DEFINER = `root`@`localhost` 
    SQL SECURITY DEFINER
VIEW `person_two` AS
    SELECT 
        `student_two`.`uni` AS `uni`,
        `student_two`.`last_name` AS `last_name`,
        `student_two`.`first_name` AS `first_name`,
        'S' AS `type`,
        `student_two`.`year` AS `year`,
        `student_two`.`school` AS `school`,
        `student_two`.`email` AS `email`,
        NULL AS `title`
    FROM
        `student_two` 
    UNION SELECT 
        `faculty_two`.`uni` AS `uni`,
        `faculty_two`.`last_name` AS `last_name`,
        `faculty_two`.`first_name` AS `first_name`,
        'F' AS `type`,
        NULL AS `year`,
        NULL AS `school`,
        `faculty_two`.`email` AS `email`,
        `faculty_two`.`title` AS `title`
    FROM
        `faculty_two`
```

- Would need to do
    - The CREATE, DELETE and UPDATE procedures.
    - Triggers and various constraints.
    
    
- __Note: Finding the next UNI must use the view, and not an individual table.__

##### Three Table Solution

| <img src="../images/three_table.jpeg"> |
| :---: |
| __Three Table Solution__ |


__Note: Constraints, etc. not added.__

```
CREATE TABLE `person_three` (
  `uni` varchar(32) NOT NULL DEFAULT '',
  `last_name` varchar(45) NOT NULL DEFAULT '',
  `first_name` varchar(45) NOT NULL DEFAULT '',
  `type` varchar(1) NOT NULL DEFAULT '',
  `email` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `student_three` (
  `uni` varchar(32) NOT NULL DEFAULT '',
  `year` varchar(45) DEFAULT NULL,
  `school` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `faculty_three` (
  `uni` varchar(32) NOT NULL DEFAULT '',
  `title` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE 
    ALGORITHM = UNDEFINED 
    DEFINER = `root`@`localhost` 
    SQL SECURITY DEFINER
VIEW `faculty_3_full` AS
    SELECT 
        `person_three`.`uni` AS `uni`,
        `person_three`.`last_name` AS `last_name`,
        `person_three`.`first_name` AS `first_name`,
        `person_three`.`type` AS `type`,
        `person_three`.`email` AS `email`,
        `faculty_three`.`title` AS `title`
    FROM
        (`person_three`
        JOIN `faculty_three` ON ((`person_three`.`uni` = `faculty_three`.`uni`)))
        
CREATE 
    ALGORITHM = UNDEFINED 
    DEFINER = `root`@`localhost` 
    SQL SECURITY DEFINER
VIEW `person_3_full` AS
    SELECT 
        `person_three`.`uni` AS `uni`,
        `person_three`.`last_name` AS `last_name`,
        `person_three`.`first_name` AS `first_name`,
        `person_three`.`type` AS `type`,
        `person_three`.`email` AS `email`,
        `student_three`.`school` AS `school`,
        `student_three`.`year` AS `year`
    FROM
        (`person_three`
        JOIN `student_three` ON ((`person_three`.`uni` = `student_three`.`uni`)))
```
        
- Still need to do all of the triggers, functions, procedures, etc.

## An Example of Some Modeling Concepts

| <img src="../images/university_er.jpeg"> |
| :---: |
| __University Conceptual Model__ |

- ```Person, Student, Faculty``` follow a three table pattern for the inheritance implementation.


- ```PersonSection``` is an associative entity.


- ```Prereqs``` is a weak entity, dependent the existence of two other entities of the same type.

## Module II $-$ Database Management System Implementation/Architecture (Reminder)

1. Storage management, disk management, buffer management, indexes.
<br><br>
1. Query processing and optimization:  Query evaluation, query parsing and parse trees, operator implementation algorithms, query rewrite, query optimization techniques.
<br><br>
1. Concurrency control and transaction management.

| <img src="../images/Module_II__DIsks_Indexes-2.jpg" width="90%"> |
| :---: |
| |
<br>

| <img src="../images/Module_II__DIsks_Indexes-3.jpg" width="90%"> |
| :---: |
| |

| <img src="../images/dbms_subsystems.jpeg" width="700px"> |
| :---: |
| __DBMS Engine Overview__ |